{
  "gtr_asl": "001",
  "type_name": "component.gt",
  "version": "001",
  "owner": "gridworks@gridworks-consulting.com",
  "description": "Component Gt. Authority for the attributes of the component.gt.000 (ComponentId, ComponentAttributeClassId, DisplayName, HwUid) belongs to the WorldRegistry. The WorldRegistry is part of the GridWorks 'BackOffice' structure for managing relational device data . Notably, ComponentId and ComponentAttributeClass are both required and immutable. HwUid is optional but once it is set to a non-null value that is also immutable - it is meant to be an immutable identifier associated to a specific physical device, ideally one that can be read remotely by the SCADA and also by the naked eye. The DisplayName is mutable, with its current value in time governed by the WorldRegistry.",
  "url": "https://g-node-registry.readthedocs.io/en/latest/component.html",
  "properties": {
    "ComponentId": {
      "type": "string",
      "format": "UuidCanonicalTextual",
      "title": "ComponentId",
      "description": "Immutable unique identifier for this specific device.",
      "required": true
    },
    "ComponentAttributeClassId": {
      "type": "string",
      "format": "UuidCanonicalTextual",
      "title": "Unique identifier for ComponentAttributeClass object articulated by the component.attribute.class.gt.001 type.",
      "description": "Unique identifier for the device class. Authority for these, as well as the relationship between Components and ComponentAttributeClasses (Cacs) is maintained by the World Registry.",
      "required": true
    },
    "ConfigList": {
      "type": "array",
      "items": {
        "type": "channel.config.000"
      },
      "description": "This list is expected to have length 0, except for nodes that do some kind of sensing - in which case it includes the information re timing of data polling and capture for the channels read by the node.",
      "required": true
    },
    "DisplayName": {
      "type": "string",
      "description": "This is an optional, mutable field whose use is strongly encouraged. It may include information about HOW the component is used in a hardware layout. It may also include the HwUid for the component.",
      "required": false
    },
    "HwUid": {
      "type": "string",
      "description": "Usually this is determined by the inheriting class.",
      "required": false
    },
    "TypeName": {
      "type": "string",
      "value": "component.gt",
      "title": "The type name"
    },
    "Version": {
      "type": "string",
      "title": "The type version",
      "default": "001",
      "required": true
    }
  },
  "formats": {
    "UuidCanonicalTextual": {
      "type": "string",
      "description": "A string of hex words separated by hyphens of length 8-4-4-4-12.",
      "example": "652ba6b0-c3bf-4f06-8a80-6b9832d60a25"
    }
  }
}
