{
  "gtr_asl": "001",
  "type_name": "hubitat.tank.component.gt",
  "version": "000",
  "owner": "gridworks@gridworks-consulting.com",
  "description": "Hubitat Tank Component (GridWorks Type). This is a specific instance of a GridWorks temp sensing Tank Module that uses a Hubitat to read the remote data. It extends the component.gt.000 type. Authority for the attributes of the component.gt.000 (ComponentId, ComponentAttributeClassId, DisplayName, HwUid) belongs to the WorldRegistry. The WorldRegistry is part of the GridWorks 'BackOffice' structure for managing relational device data . Notably, ComponentId and ComponentAttributeClass are both required and immutable. HwUid is optional but once it is set to a non-null value that is also immutable - it is meant to be an immutable identifier associated to a specific physical device, ideally one that can be read remotely by the SCADA and also by the naked eye. The DisplayName is mutable, with its current value in time governed by the WorldRegistry.",
  "url": "https://gridworks-protocol.readthedocs.io/en/latest/gridworks-tank-module-1.html",
  "properties": {
    "ComponentId": {
      "type": "string",
      "format": "UUID4Str",
      "title": "Component Id",
      "description": "Primary GridWorks identifier for a specific physical instance of a GridWorks TankModule1 and also as a more generic Component.",
      "required": true
    },
    "ComponentAttributeClassId": {
      "type": "string",
      "format": "UuidCanonicalTextual",
      "title": "Unique identifier for ComponentAttributeClass object articulated by the component.attribute.class.gt.001 type.",
      "description": "Unique identifier for the device class. Authority for these, as well as the relationship between Components and ComponentAttributeClasses (Cacs) is maintained by the World Registry.",
      "required": true
    },
    "Tank": {
      "type": "dictDict",
      "description": "The configuration information (HubitatTankSettingsGt) about the 4 analog temperature sensors for a GridWorks TankModule1.",
      "required": true
    },
    "DisplayName": {
      "type": "string",
      "description": "Sample: GridWorks TankModule <buffer> SN 1010",
      "required": false
    },
    "HwUid": {
      "type": "string",
      "description": "Use the GridWorks Serial number for GridWorks TankModule1.",
      "required": false
    },
    "TypeName": {
      "type": "string",
      "value": "hubitat.tank.component.gt",
      "title": "The type name"
    },
    "Version": {
      "type": "string",
      "title": "The type version",
      "default": "000",
      "required": true
    }
  }
}
