{
    "gtr_asl": "001",
    "type_name": "relay.component.gt",
    "version": "000",
    "owner": "gridworks@gridworks-consulting.com",
    "description": "Type for tracking Relay Components. Designed for Relays. It extends the component.gt.000 type. Authority for the attributes of the component.gt.000 (ComponentId, ComponentAttributeClassId, DisplayName, HwUid) belongs to the WorldRegistry. The WorldRegistry is part of the GridWorks 'BackOffice' structure for managing relational device data . Notably, ComponentId and ComponentAttributeClass are both required and immutable. HwUid is optional but once it is set to a non-null value that is also immutable - it is meant to be an immutable identifier associated to a specific physical device, ideally one that can be read remotely by the SCADA and also by the naked eye. The DisplayName is mutable, with its current value in time governed by the WorldRegistry.",
    "url": "https://g-node-registry.readthedocs.io/en/latest/component.html",
    "properties": {
        "ComponentId": {
            "type": "string",
            "format": "UuidCanonicalTextual",
            "title": "Component Id",
            "description": "Primary GridWorks identifier for a specific physical instance of a Relay, and also as a more generic Component.",
            "required":  true
        },
        "ComponentAttributeClassId": {
            "type": "string",
            "format": "UuidCanonicalTextual",
            "title": "Unique identifier for RelayCac object articulated by the relay.cac.gt.000 type.",
            "description": "Unique identifier for the device class. Authority for these, as well as the relationship between Components and ComponentAttributeClasses (Cacs) is maintained by the World Registry.",
            "required":  true
        },
        "DisplayName": {
            "type": "string",
            "required":  false
        },
        "Gpio": {
            "type": "integer",
            "required":  false
        },
        "HwUid": {
            "type": "string",
            "required":  false
        },
        "NormallyOpen": {
            "type": "boolean",
            "description": "Normally open relays default in the open position, meaning that when they're not in use, there is no contact between the circuits. When power is introduced, an electromagnet pulls the first circuit into contact with the second, thereby closing the circuit and allowing power to flow through",
            "required":  true
        },
        "TypeName": {
            "type": "string",
            "value": "relay.component.gt",
            "title": "The type name"
        },
        "Version": {
            "type": "string",
            "title": "The type version",
            "default": "000",
            "required": true
        }
    },
    "formats": {
        "UuidCanonicalTextual": {
            "type": "string",
            "description": "A string of hex words separated by hyphens of length 8-4-4-4-12.",
            "example": "652ba6b0-c3bf-4f06-8a80-6b9832d60a25"
        }
    }
}

