{
  "gtr_asl": "001",
  "enum_name": "sh.actor.class",
  "enum_version": "001",
  "description": "Determines the code running Spaceheat Nodes supervised by Spaceheat SCADA software",
  "url": "https://gridworks-protocol.readthedocs.io/en/latest/actor-class.html",
  "ssot": "https://gridworks-type-registry.readthedocs.io/en/latest/enums.html#shactorclass",
  "values": [
    "NoActor",
    "Scada",
    "HomeAlone",
    "BooleanActuator",
    "PowerMeter",
    "Atn",
    "SimpleSensor",
    "MultipurposeSensor",
    "Thermostat",
    "HubitatTelemetryReader",
    "HubitatTankModule",
    "HubitatPoller"
  ],
  "value_to_symbol": {
    "NoActor": "00000000",
    "Scada": "6d37aa41",
    "HomeAlone": "32d3d19f",
    "BooleanActuator": "fddd0064",
    "PowerMeter": "2ea112b9",
    "Atn": "b103058f",
    "SimpleSensor": "dae4b2f0",
    "MultipurposeSensor": "7c483ad0",
    "Thermostat": "4a9c1785",
    "HubitatTelemetryReader": "0401b27e",
    "HubitatTankModule": "e2877329",
    "HubitatPoller": "00000100"
  },
  "value_to_version": {
    "NoActor": "000",
    "Scada": "000",
    "HomeAlone": "000",
    "BooleanActuator": "000",
    "PowerMeter": "000",
    "Atn": "000",
    "SimpleSensor": "000",
    "MultipurposeSensor": "000",
    "Thermostat": "000",
    "HubitatTelemetryReader": "001",
    "HubitatTankModule": "001",
    "HubitatPoller": "001"
  },
  "value_descriptions": {
    "NoActor": "A SpaceheatNode that does not have any code running on its behalf within the SCADA, but is instead only a reference object (for example, a tank of hot water or a resistive element) that can be discussed (for example, the power drawn by the resistive element can be measured) or evaluated (for example, a set of 5 different temperatures in different places on the tank can be used to estimate total thermal energy in the tank).",
    "Scada": "The SCADA actor is the prime piece of code running and supervising other ProActors within the SCADA code. It is also responsible for managing the state of TalkingWith the AtomicTNode, as well maintaining and reporting a boolean state variable that indicates whether it is following dispatch commands from the AtomicTNode XOR following dispatch commands from its own HomeAlone actor.",
    "HomeAlone": "HomeAlone is an abstract Spaceheat Actor responsible for dispatching the SCADA when it is not talking with the AtomicTNode.",
    "BooleanActuator": "A SpaceheatNode representing a generic boolean actuator capable of turning on (closing a circuit) or turning off (opening a circuit).",
    "PowerMeter": "A SpaceheatNode representing the power meter that is used to settle financial transactions with the TerminalAsset. That is, this is the power meter whose accuracy is certified in the creation of the TerminalAsset GNode via creation of the TaDeed. More Info: https://gridworks.readthedocs.io/en/latest/terminal-asset.html",
    "Atn": "A SpaceheatNode representing the AtomicTNode. Note that the code running the AtomicTNode is not local within the SCADA code, except for a stub used for testing purposes. More Info: https://gridworks.readthedocs.io/en/latest/atomic-t-node.html",
    "SimpleSensor": "A SpaceheatNode representing a sensor that measures a single category of quantity (for example, temperature) for a single object (for example, on a pipe). More Info: https://gridworks-protocol.readthedocs.io/en/latest/simple-sensor.html",
    "MultipurposeSensor": "A sensor that either reads multiple kinds of readings from the same sensing device (for example reads current and voltage), reads multiple different objects (temperature from two different thermisters) or both. More Info: https://gridworks-protocol.readthedocs.io/en/latest/multipurpose-sensor.html",
    "Thermostat": "A SpaceheatNode representing a thermostat.",
    "HubitatTelemetryReader": "A generic actor for reading telemetry data from a Hubitat Home Automation Hub LAN API. More Info: https://drive.google.com/drive/u/0/folders/1AqAU_lC2phzuI9XRYvogiIYA7GXNtlr6",
    "HubitatTankModule": "The actor for running a GridWorks TankModule, comprised of two Z-Wave Fibaro temp sensors built together inside a small container that has 4 thermistors attached. These are designed to be installed from top (1) to bottom (4) on a stratified thermal storage tank. More Info: https://drive.google.com/drive/u/0/folders/1GSxDd8Naf1GKK_fSOgQU933M1UcJ4r8q",
    "HubitatPoller": "An actor for representing a somewhat generic ShNode (like a thermostat) that can be polled through the Hubitat."
  },
  "default_value": "NoActor"
}
